# Speed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DataTransferProgressChangedEventArgs..::..Speed Property
DataTransferProgressChangedEventArgs Class See Also
---
Speed(bytes/second) in this event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double Speed { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Speed As Double
	Get
```

Visual C++
---
```text
public:
property double Speed {
	double get ();
}
```

# See Also
DataTransferProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace